Revit 2026 API

# ExternalCommandDataJournalData Property

---

A data map that can be used to read and write data to the Autodesk Revit journal file.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IDictionary<string, string> JournalData { get; set; }
```
```vb
Public Property JournalData As IDictionary(Of String, String)
	Get
	Set
```
```cpp
public:
property IDictionary<String^, String^>^ JournalData {
	IDictionary<String^, String^>^ get ();
	void set (IDictionary<String^, String^>^ value);
}
```
```fsharp
member JournalData : IDictionary<string, string> with get, set
```

#### Property Value

IDictionaryString, String

The data map is a string to string map that can be used to store data in the Revit journal file at the end of execution of the external command. If the command is then executed from the journal file during playback this data is then passed to the external command in this Data property so the external command can execute with this passed data in a UI-less mode, hence providing non interactive journal playback for automated testing purposes. For more information on Revit's journaling features contact the Autodesk Developer Network.

#### Reference

ExternalCommandData Class

Autodesk.Revit.UI Namespace